#Початок подорожі
print(' Вийшли ви на поріг.\n \
Невстигли ви одуматись як Ваши ноги занесли вас в темний сірий ліс.\n \
Листя не колихається, птахи не співають.\n \
Тільки чути як на верхів`яx дерев колихаються листя від вітру.\n \
Ви опинились на стежинці яка веде десь далі')
chois = int(input(' Що Ви оберете підете далі чи повернетесь додому\n \
1. Піду далі\n \
2. Повернусь додому: '))

#Перевірка вводу
chois2 = True
while chois2:
	if chois != 1 and chois != 2:
		chois = int(input(' Ви ввели невірне значення, введіть 1 чи 2: '))
	else:
		break
# Вибір напрямку
if chois == 2:
	exit(' Ви позбавили себе пригод і емоцій на все життя')
elif chois == 1:
	print(' Ви зробили правельний вибір!\n \
Ваші ноги почали рухатись в перед на зустріч пригодам.')
#else:
	#exit(' Ви ввели невірне значення.\n \
#Програма завершила свою роботу')
print()

#Перший ворог
print(' Пройшли ви другий поворт,\n \
як обрнувшись ви не бачите початку вашої стежини.\n \
І тут ви чуєте легкий шерех листя на землі.\n \
Піднявши очі до гори як раптом перед вами стоїть величезний павук')
print()
chois = int(input(' Перед Вами постає вибір що роботи втікати чи вступити в бій\n \
1. Вступити в бій\n \
2. Втікти: '))
print()

#Перевірка вводу
chois2 = True
while chois2:
	if chois != 1 and chois != 2:
		chois = int(input(' Ви ввели невірне значення, введіть 1 чи 2: '))
	else:
		break

#Вибір дії
if chois == 2:
	exit(' Павук Вас наздогнав, лапою пробив Вам плече,\n \
прижавши до землі і встромив своє жало вспину.\n \
Обмотав тіло павутиною, павук підвісив вас на гілці\n \
величезного дерева щоб потім Вами поласувати.\n \
Кінець вашої подоріжжі і життя')
elif chois == 1:
	print(' Ви дістали свій меч і встромили його в павука,\n \
від болю павук упав і сжався.\n \
Діставши свій меч з тіла павука ви пішли далі')

print()
print()
# Нова пригода
print(' Заспокоївшись, перевівши дух, пішли далі,\n \
на натрапили на річку, широку та гливобу, яку в не перепливти,\n \
"потрібен човен" - подумали ви. Як раптом ви почули дивний голос...')
print( ' Ви: озирнувшись, ви нікого не побачили')
chois = int(input(' Голос: так тобі потрібен човен чи ні? - запитав дивний голос.\n\
 1. Так потрібен\n\
 2. Ні я сам перепливу: '))

 #Перевірка вводу
chois2 = True
while chois2:
	if chois != 1 and chois != 2:
		chois = int(input(' Ви ввели невірне значення, введіть 1 чи 2: '))
	else:
		break

#Вибір дії
if chois  == 2:
	exit(' Вам невдалось перепливти річку, ви потонули.\n \
Стали закускою для річкових мешкінців.')
elif chois == 1:
	print(' Добре, але є одна умова, тобі потрібно відповісти на мої три запитання.\n \
на кожне питання в тебе 3 спроби')

print()
print(' Запитання перше.')
#Цикл
popytka = 0
#Продовження циклу
quesses_it = True
while popytka != 3:
	day = int(input(' Скільки днів у році? '))
	popytka += 1
	print(' Використано спроб ' + str(popytka))
	if day == 365:
		print(' Гарна робота')
		print(' Переходимо до наступного питання.')
		break
	else:
		print(' Ваша відповідь не правельна')
else:
	exit(' Ви залишились в лісі назавжди, і померли з голоду!')
print()
print(' Запитання друге.')
#Цикл
popytka = 0
#Продовження циклу
quesses_it = True
while popytka != 3:
	day = int(input(' Скільки буде 6 помножити на 8? '))
	popytka += 1
	print(' Використано спроб ' + str(popytka))
	if day == 48:
		print(' Гарна робота')
		print(' Переходимо до наступного питання.')
		break
	else:
		print(' Ваша відповідь не правельна')
else:
	exit(' Ви залишились в лісі назавжди, і померли з голоду!')
print()
print(' Запитання третє.')
#Цикл
popytka = 0
#Продовження циклу
quesses_it = True
while popytka != 3:
	day = int(input(' Яка відповідь була на питання:\n \
"О жизни, вселенно и вообще", в фильме Автостопом по галактике: '))
	popytka += 1
	print(' Використано спроб ' + str(popytka))
	if day == 42:
		print(' Гарна робота')
		print(' Ось тримай човен')
		break
	else:
		print(' Ваша відповідь не правельна')
else:
	exit(' Ви залишились в лісі назавжди, і померли з голоду!')
print(' Ви перепливли річку, подякували голосу за човен, і пішли.\n \
Опинились на краю лісу з відки ви і прийшли.')
print(' Гарна прогулянка лісом.')
